#!/usr/bin/python
#coding: utf-8

from __future__ import unicode_literals

import unittest
import xlrd

import cell_parser

class LocationsTest(unittest.TestCase):
  def setUp(self):
    self.values = [ \
      'МСС /211 ГК , 532 ГК/', \
      'Теория игр и принятие решений / Доцент Меньшиков И. С. - для "кт" и "эк" - обязательно; для "мф" - а. к. -1 110 КПМ', \
      'Механика сплошных сред Проф. Жмур В. В. -211 ГК проф. Рыжак Е. И. - 532 ГК', \
      'Альтерн. курсы 1 из 4-х: 1 Физика низкотемпературной плазмы 117 ГК 2. Биофизика 113 ГК', \
      'Лин методы в р/т /Доц. Григорьев А. А. /117 ГК', \
      'Теоретическая физика 202 НК, Б. Физ. , 123 ГК, 432 ГК, 521 ГК, 532 ГК, 507а ГК, 509 ГК, 511 ГК', \
      'Функциональный анализ ( 31б, 32а, 33, 34в, 36бв)/Доцент Боговский М. Е. / 430 ГК Уравнения математической физики (31а, 32б, 34аб, 35, 36а) /Доцент Шаньков В. В. /Акт. зал', \
      'Физические основы фотоники и нанофотоники /Профессор Фомичёв А. А. / 113 ГК', \
      'Вычислительная математика /Лобачев/ 202 НК', \
      'Сетевые технологии /Ст. преп. Подлесных / 113 ГК', \
      'Основы физики конденсированного состояния /К. ф. -м. н. Куксин А. Ю/ 516а ГК -альт. курс', \
      'Теоретическая физика Б. Хим. , 430 ГК, 113 ГК', \
      'Диф. ур-ния Б. Хим', \
      'оодкдз/401кпм КПМ401 КПМ', \
      'Общеинженерная подготовка /Нечетная неделя/ 301ЛК', \
      '' \
    ]
    self.answers = [ \
      [('211', 'ГК'), ('532', 'ГК')], \
      [('110', 'КПМ')], \
      [('211', 'ГК'), ('532', 'ГК')], \
      [('117', 'ГК'), ('113', 'ГК')], \
      [('117', 'ГК')], \
      [('202', 'НК'), ('123', 'ГК'), ('432', 'ГК'), ('521', 'ГК'), ('532', 'ГК'), ('507а', 'ГК'), ('509', 'ГК'), ('511', 'ГК'), ('Б. Физ.', None)], \
      [('430', 'ГК'), ('Акт. Зал', None)], \
      [('113', 'ГК')], \
      [('202', 'НК')], \
      [('113', 'ГК')], \
      [('516а', 'ГК')], \
      [('430', 'ГК'), ('113', 'ГК'), ('Б. Хим.', None)], \
      [('Б. Хим.', None)], \
      [('401', 'КПМ')], \
      [('301', 'ЛК')], \
      [], \
    ]
  def runTest(self):
    for i in xrange(len(self.values)):
      self.assertEqual(cell_parser.GetLocations(self.values[i]), self.answers[i])

class TeachersTest(unittest.TestCase):
  def setUp(self):
    self.values = [ \
      'МСС /211 ГК , 532 ГК/', \
      'Теория игр и принятие решений / Доцент Меньшиков И. С. - для "кт" и "эк" - обязательно; для "мф" - а. к. -1 110 КПМ', \
      'Механика сплошных сред Проф. Жмур В. В. -211 ГК проф. Рыжак Е. И. - 532 ГК', \
      'Альтерн. курсы 1 из 4-х: 1 Физика низкотемпературной плазмы 117 ГК 2. Биофизика 113 ГК', \
      'Лин методы в р/т /Доц. Григорьев А. А. /117 ГК', \
      'Теоретическая физика 202 НК, Б. Физ. , 123 ГК, 432 ГК, 521 ГК, 532 ГК, 507а ГК, 509 ГК, 511 ГК', \
      'Функциональный анализ ( 31б, 32а, 33, 34в, 36бв)/Доцент Боговский М. Е. / 430 ГК Уравнения математической физики (31а, 32б, 34аб, 35, 36а) /Доцент Шаньков В. В. /Акт. зал', \
      'Физические основы фотоники и нанофотоники /Профессор Фомичёв А. А. / 113 ГК', \
      'Вычислительная математика /Лобачев/ 202 НК', \
      'Сетевые технологии /Ст. преп. Подлесных / 113 ГК', \
      'Основы физики конденсированного состояния /К. ф. -м. н. Куксин А. Ю/ 516а ГК -альт. курс', \
      'Теоретическая физика Б. Хим. , 430 ГК, 113 ГК', \
      'Диф. ур-ния Б. Хим', \
      'оодкдз/401кпм КПМ401 КПМ', \
      'Общеинженерная подготовка /Нечетная неделя/ 301ЛК', \
      '' \
    ]
    self.answers = [ \
      [], \
      [('Меньшиков', 'И', 'С')], \
      [('Жмур', 'В', 'В'), ('Рыжак', 'Е', 'И')], \
      [], \
      [('Григорьев', 'А', 'А')], \
      [], \
      [('Боговский', 'М', 'Е'), ('Шаньков', 'В', 'В')], \
      [('Фомичёв', 'А', 'А')], \
      [('Лобачев', None, None)], \
      [('Подлесных', None, None)], \
      [('Куксин', 'А', 'Ю')], \
      [], \
      [], \
      [], \
      [], \
      [], \
    ]
  def runTest(self):
    for i in xrange(len(self.values)):
      self.assertEqual(cell_parser.GetTeachers(self.values[i]), self.answers[i])

if __name__ == '__main__':
   unittest.main()
