#!/usr/bin/python
#coding: utf-8

import unittest
import xlrd

import cell_parser

class LocationsTest(unittest.TestCase):
  def setUp(self):
    self.values = [ \
      u'МСС /211 ГК , 532 ГК/', \
      u'Теория игр и принятие решений / Доцент Меньшиков И. С. - для "кт" и "эк" - обязательно; для "мф" - а. к. -1 110 КПМ', \
      u'Механика сплошных сред Проф. Жмур В. В. -211 ГК проф. Рыжак Е. И. - 532 ГК', \
      u'Альтерн. курсы 1 из 4-х: 1 Физика низкотемпературной плазмы 117 ГК 2. Биофизика 113 ГК', \
      u'Лин методы в р/т /Доц. Григорьев А. А. /117 ГК', \
      u'Теоретическая физика 202 НК, Б. Физ. , 123 ГК, 432 ГК, 521 ГК, 532 ГК, 507а ГК, 509 ГК, 511 ГК', \
      u'Функциональный анализ ( 31б, 32а, 33, 34в, 36бв)/Доцент Боговский М. Е. / 430 ГК Уравнения математической физики (31а, 32б, 34аб, 35, 36а) /Доцент Шаньков В. В. /Акт. зал', \
      u'Физические основы фотоники и нанофотоники /Профессор Фомичёв А. А. / 113 ГК', \
      u'Вычислительная математика /Лобачев/ 202 НК', \
      u'Сетевые технологии /Ст. преп. Подлесных / 113 ГК', \
      u'Основы физики конденсированного состояния /К. ф. -м. н. Куксин А. Ю/ 516а ГК -альт. курс', \
      u'Теоретическая физика Б. Хим. , 430 ГК, 113 ГК', \
      u'Диф. ур-ния Б. Хим', \
      u'оодкдз/401кпм КПМ401 КПМ', \
      u'Общеинженерная подготовка /Нечетная неделя/ 301ЛК', \
      u'' \
    ]
    self.answers = [ \
      [(u'211', u'ГК'), (u'532', u'ГК')], \
      [(u'110', u'КПМ')], \
      [(u'211', u'ГК'), (u'532', u'ГК')], \
      [(u'117', u'ГК'), (u'113', u'ГК')], \
      [(u'117', u'ГК')], \
      [(u'202', u'НК'), (u'123', u'ГК'), (u'432', u'ГК'), (u'521', u'ГК'), (u'532', u'ГК'), (u'507а', u'ГК'), (u'509', u'ГК'), (u'511', u'ГК'), (u'Б. Физ.', None)], \
      [(u'430', u'ГК'), (u'Акт. Зал', None)], \
      [(u'113', u'ГК')], \
      [(u'202', u'НК')], \
      [(u'113', u'ГК')], \
      [(u'516а', u'ГК')], \
      [(u'430', u'ГК'), (u'113', u'ГК'), (u'Б. Хим.', None)], \
      [(u'Б. Хим.', None)], \
      [(u'401', u'КПМ')], \
      [(u'301', u'ЛК')], \
      [], \
    ]
  def runTest(self):
    for i in xrange(len(self.values)):
      self.assertEqual(cell_parser.GetLocations(self.values[i]), self.answers[i])

class TeachersTest(unittest.TestCase):
  def setUp(self):
    self.values = [ \
      u'МСС /211 ГК , 532 ГК/', \
      u'Теория игр и принятие решений / Доцент Меньшиков И. С. - для "кт" и "эк" - обязательно; для "мф" - а. к. -1 110 КПМ', \
      u'Механика сплошных сред Проф. Жмур В. В. -211 ГК проф. Рыжак Е. И. - 532 ГК', \
      u'Альтерн. курсы 1 из 4-х: 1 Физика низкотемпературной плазмы 117 ГК 2. Биофизика 113 ГК', \
      u'Лин методы в р/т /Доц. Григорьев А. А. /117 ГК', \
      u'Теоретическая физика 202 НК, Б. Физ. , 123 ГК, 432 ГК, 521 ГК, 532 ГК, 507а ГК, 509 ГК, 511 ГК', \
      u'Функциональный анализ ( 31б, 32а, 33, 34в, 36бв)/Доцент Боговский М. Е. / 430 ГК Уравнения математической физики (31а, 32б, 34аб, 35, 36а) /Доцент Шаньков В. В. /Акт. зал', \
      u'Физические основы фотоники и нанофотоники /Профессор Фомичёв А. А. / 113 ГК', \
      u'Вычислительная математика /Лобачев/ 202 НК', \
      u'Сетевые технологии /Ст. преп. Подлесных / 113 ГК', \
      u'Основы физики конденсированного состояния /К. ф. -м. н. Куксин А. Ю/ 516а ГК -альт. курс', \
      u'Теоретическая физика Б. Хим. , 430 ГК, 113 ГК', \
      u'Диф. ур-ния Б. Хим', \
      u'оодкдз/401кпм КПМ401 КПМ', \
      u'Общеинженерная подготовка /Нечетная неделя/ 301ЛК', \
      u'' \
    ]
    self.answers = [ \
      [], \
      [(u'Меньшиков', u'И', u'С')], \
      [(u'Жмур', u'В', u'В'), (u'Рыжак', u'Е', u'И')], \
      [], \
      [(u'Григорьев', u'А', u'А')], \
      [], \
      [(u'Боговский', u'М', u'Е'), (u'Шаньков', u'В', u'В')], \
      [(u'Фомичёв', u'А', u'А')], \
      [(u'Лобачев', None, None)], \
      [(u'Подлесных', None, None)], \
      [(u'Куксин', u'А', u'Ю')], \
      [], \
      [], \
      [], \
      [], \
      [], \
    ]
  def runTest(self):
    for i in xrange(len(self.values)):
      self.assertEqual(cell_parser.GetTeachers(self.values[i]), self.answers[i])

if __name__ == '__main__':
   unittest.main()
